commands/setvolume.txt

POST /MediaRenderer/RenderingControl/Control HTTP/1.1
CONNECTION: close
ACCEPT-ENCODING: gzip
HOST: {ip}:1400
USER-AGENT: Linux UPnP/1.0 Sonos/62.1-86220 (WDCR:Microsoft Windows NT 10.0.19042)
X-Sonos-Api-Key: ffffffff-ffff-ffff-ffff-ffffffffffff
X-Sonos-Corr-Id: ffffffff-ffff-ffff-ffff-ffffffffffff
CONTENT-LENGTH: {cl}
CONTENT-TYPE: text/xml; charset="utf-8"
X-SONOS-TARGET-UDN: uuid:{uuid}
SOAPACTION: "urn:schemas-upnp-org:service:RenderingControl:1#SetVolume"

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><s:Body><u:SetVolume xmlns:u="urn:schemas-upnp-org:service:RenderingControl:1"><InstanceID>0</InstanceID><Channel>Master</Channel><DesiredVolume>{volume}</DesiredVolume></u:SetVolume></s:Body></s:Envelope>